#Задание 1
name = 'Анна'
period = '10'
number = '5,3'
result= 'True'
report = 'None'

print(name)
print(period)
print(number)
print(result)
print(report)


name = str(input('Введите Ваше имя: '))
print(name)

age = int(input('Сколько Вам лет? '))
print(age)

city = str(input('В каком городе Вы живете? '))
print(city)